# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [29]:
import numpy as np
import pandas as pd

In [30]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  'D': [10, np.nan, np.nan]})

In [31]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

**Check Missing data existance**

In [32]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False   True  False   True
2   True   True  False   True

In [33]:
df.isna().sum(axis=0)

A    1
B    2
C    0
D    2
dtype: int64

In [34]:
df.isna().sum(axis=1)

0    0
1    2
2    3
dtype: int64

**Droping missing data**

In [35]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [36]:
df.dropna(axis=0, inplace=True)

In [37]:
df

     A    B  C     D
0  1.0  5.0  1  10.0

In [70]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  'D': [10, np.nan, np.nan]})

In [72]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [73]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [74]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [75]:
df.dropna(thresh=1, axis=0)

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [76]:
df.dropna(thresh=2)

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN

In [77]:
df.dropna(thresh=3)

     A    B  C     D
0  1.0  5.0  1  10.0

**Fill missing data**

In [78]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

:

In [46]:
df.fillna(value=10)

      A     B  C     D
0   1.0   5.0  1  10.0
1   2.0  10.0  2  10.0
2  10.0  10.0  3  10.0

In [47]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [48]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [49]:
df['A'].mean()

1.5

In [50]:
df['A'].fillna(value=df['A'].mean(), inplace=True)

In [51]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  1.5  NaN  3   NaN

In [52]:
df.fillna(value=df['A'].mean(), inplace=True)

In [53]:
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  1.5  2   1.5
2  1.5  1.5  3   1.5

In [54]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3],
                  'D': [10, np.nan, np.nan]})
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  NaN  2   NaN
2  NaN  NaN  3   NaN

In [55]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [56]:
for col in df.columns:
    df[col].fillna(value=df[col].mean(), inplace=True)
df

     A    B  C     D
0  1.0  5.0  1  10.0
1  2.0  5.0  2  10.0
2  1.5  5.0  3  10.0

# Great Job!